In [11]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter

In [14]:
data = pd.read_csv('data.csv')
data.head(3)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015

In [15]:
len(data)

1890

# Предобработка датасета

In [69]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [17]:

data[data['budget']== data['budget'].max()].original_title.value_counts()

The Warrior's Way    1
Name: original_title, dtype: int64

In [70]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
answer_ls.append(4)
print(answer_ls)

[4]

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [18]:
#runtime
data[data['runtime']== data['runtime'].max()].original_title.value_counts()

Gods and Generals    1
Name: original_title, dtype: int64

In [71]:
answer_ls.append(2)
print(answer_ls)

[4, 2]

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [19]:
data[data['runtime']== data['runtime'].min()].original_title.value_counts()

Winnie the Pooh    1
Name: original_title, dtype: int64

In [72]:
answer_ls.append(3)
print(answer_ls)

[4, 2, 3]

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [20]:
round(data['runtime'].mean(),0)

110.0

In [73]:
answer_ls.append(2)
print(answer_ls)

[4, 2, 3, 2]

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [21]:
round(data['runtime'].median(),0)

106.0

In [74]:
answer_ls.append(1)
print(answer_ls)

[4, 2, 3, 2, 1]

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [22]:
#revenue
data[data['revenue']== data['revenue'].max()].original_title.value_counts()

Avatar    1
Name: original_title, dtype: int64

In [75]:
answer_ls.append(5)
print(answer_ls)

[4, 2, 3, 2, 1, 5]

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [23]:
a= data[data['original_title']=='Supernova'].revenue.sum()
b =data[data['original_title']=="The Warrior's Way"].revenue.sum()
c =data[data['original_title']=='Flushed Away'].revenue.sum()
d =data[data['original_title']=="The Adventures of Pluto Nash"].revenue.sum()
e =data[data['original_title']=='The Lone Ranger'].revenue.sum()
list_small = [a,b,c,d,e]
df_small = pd.DataFrame({'film': "Supernova, The Warrior's Way, Flushed Away, The Adventures of Pluto Nash, The Lone Ranger".split(','),
                         'revenue': [a, b, c, d, e]}, 
                  index = [1, 2, 3, 4, 5])
df_small[df_small['revenue']==df_small['revenue'].min()].film.value_counts()
#df_small.groupby(by = ["revenue"])['film'].sum()

 The Adventures of Pluto Nash    1
Name: film, dtype: int64

In [106]:
#data2=data.query('original_title in ["Supernova", "Flushed Away", "The Adventures of Pluto Nash","The Lone Ranger","The Warriors Way"]')
#data2

In [76]:
answer_ls.append(4)
print(answer_ls)

[4, 2, 3, 2, 1, 5, 4]

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [24]:
def rev_bud(x):
    y = x['revenue'] - x['budget']
    return y
data['income'] = data.apply(rev_bud, axis =1)
data.head(10)
data[data['income']>0].income.count()

1478

In [77]:
answer_ls.append(1)
print(answer_ls)

[4, 2, 3, 2, 1, 5, 4, 1]

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [25]:
income_2008 = data[data.release_year == 2008].income.max()
display(data[(data.income == income_2008)])

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,income
600,tt0468569,8.466668,185000000,1001921825,The Dark Knight,Christian Bale|Michael Caine|Heath Ledger|Aaro...,Christopher Nolan,Why So Serious?,Batman raises the stakes in his war on crime. ...,152,Drama|Action|Crime|Thriller,DC Comics|Legendary Pictures|Warner Bros.|Syncopy,7/16/2008,8432,8.1,2008,816921825

In [78]:
answer_ls.append(4)
print(answer_ls)

[4, 2, 3, 2, 1, 5, 4, 1, 4]

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [26]:
income_2012_2014 = data[(data.release_year >= 2012) & (data.release_year <= 2014)].income.min()
display(data[(data.income == income_2012_2014)])
income_2012_2014

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,income
1246,tt1210819,1.21451,255000000,89289910,The Lone Ranger,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Gore Verbinski,Never Take Off the Mask,The Texas Rangers chase down a gang of outlaws...,149,Action|Adventure|Western,Walt Disney Pictures|Jerry Bruckheimer Films|I...,7/3/2013,1607,6.0,2013,-165710090

-165710090

In [79]:
answer_ls.append(5)

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [27]:
s = data['genres'].value_counts()
display(s[0:1])

Comedy    141
Name: genres, dtype: int64

In [80]:
answer_ls.append(4)
print(answer_ls)

[4, 2, 3, 2, 1, 5, 4, 1, 4, 5, 4]

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [28]:
s = data[data['income'] >0].genres.value_counts()
s

Comedy                                     121
Drama                                       70
Comedy|Romance                              52
Drama|Romance                               38
Horror|Thriller                             31
                                          ...
Thriller|Action|Fantasy|Horror               1
Action|Thriller|Science Fiction|Mystery      1
Comedy|Family|Fantasy|Science Fiction        1
Family|Fantasy|Adventure                     1
Crime|Adventure|Action|Comedy|Thriller       1
Name: genres, Length: 548, dtype: int64

In [81]:
answer_ls.append(2)
print(answer_ls)

[4, 2, 3, 2, 1, 5, 4, 1, 4, 5, 4, 2]

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [29]:
s= data.groupby(by = ['director'])['original_title'].count()
s.sort_values()

director
Aaron Seltzer|Jason Friedberg       1
Liz Friedlander                     1
Louis Leterrier|Corey Yuen Kwai     1
Mabrouk El Mechri                   1
Marcel Langenegger                  1
                                   ..
Steven Spielberg                   10
Shawn Levy                         10
Clint Eastwood                     12
Ridley Scott                       12
Steven Soderbergh                  13
Name: original_title, Length: 958, dtype: int64

In [82]:
answer_ls.append(1)

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [30]:
s1= data[data['income'] > 0].groupby(by = ['director'])['original_title'].count()
s1.sort_values()

director
Aaron Seltzer|Jason Friedberg      1
Joel Edgerton                      1
Joel Coen|Ethan Coen               1
Ricky Gervais|Matthew Robinson     1
Rob Bowman                         1
                                  ..
Shawn Levy                         9
Clint Eastwood                    10
Steven Soderbergh                 10
Steven Spielberg                  10
Ridley Scott                      12
Name: original_title, Length: 774, dtype: int64

In [83]:
answer_ls.append(4)

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [31]:
s2= data[data['income'] == data['income'].max()].groupby(by = ['director']).describe()
s2
#надо просуммировать прибыль по режисеерам

              popularity                                              \
                   count      mean std       min       25%       50%
director
James Cameron        1.0  9.432768 NaN  9.432768  9.432768  9.432768

                                  budget               ... release_year  \
                    75%       max  count         mean  ...          75%
director                                               ...
James Cameron  9.432768  9.432768    1.0  237000000.0  ...       2009.0

                      income                                                \
                  max  count          mean std           min           25%
director
James Cameron  2009.0    1.0  2.544506e+09 NaN  2.544506e+09  2.544506e+09


                        50%           75%           max
director
James Cameron  2.544506e+09  2.544506e+09  2.544506e+09

[1 rows x 64 columns]

In [84]:
answer_ls.append(4)

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [33]:
def actor_revenue(df):
    summ = Counter()
    for i in range(len(df)):
        for j in df.iloc[i].cast.split('|'):
            summ[j] += df.iloc[i].income
    return pd.DataFrame.from_dict(summ, orient='index', columns = ['Summ'])
display(actor_revenue(data).sort_values(by=['Summ'], ascending = False))

                          Summ
Emma Watson         6666245597
Daniel Radcliffe    6514990281
Rupert Grint        6408638290
Ian McKellen        6087375777
Robert Downey Jr.   5316030161
...                        ...
Elisabeth Harnois   -111007242
Emilio EchevarrÃ­a  -119180039
Kate Bosworth       -369455668
Ti Lung             -413912431
Jang Dong-gun       -413912431

[3408 rows x 1 columns]

In [85]:
answer_ls.append(1)

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [34]:
display(actor_revenue(data[data.release_year == 2012]).sort_values(by=['Summ'], ascending = False))

                          Summ
Chris Hemsworth     1542450773
Denis Leary         1319460639
Robert Downey Jr.   1299557910
Mark Ruffalo        1299557910
Scarlett Johansson  1299557910
...                        ...
Malin Ã…kerman       -43733509
Timothy Spall        -51893525
James Kidnie         -51893525
Heidi Hawkins        -51893525
Kirsten Dunst        -68109207

[466 rows x 1 columns]

In [86]:
answer_ls.append(3)

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [37]:
def film_n (x):
    y = 1
    return y
data['film_n'] = data.apply(film_n, axis =1)
def actor_2 (df):
    num = Counter()
    for i in range(len(df)):
        for j in df.iloc[i].cast.split('|'):
            num[j] += df.iloc[i].film_n
    return pd.DataFrame.from_dict(num, orient='index', columns = ['Num'])
display(actor_2(data[data['budget']>data['budget'].mean()]).sort_values(by=['Num'], ascending = False))

                   Num
Matt Damon          18
Adam Sandler        17
Angelina Jolie      16
Tom Cruise          15
Samuel L. Jackson   15
...                ...
Jon Bernthal         1
Tyler Perry          1
Cliff Robertson      1
Carrie Coon          1
Piper Perabo         1

[1508 rows x 1 columns]

In [87]:
answer_ls.append(3)

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [38]:
count_genres = Counter()
for x in data.loc[data['cast'].map(lambda x: True if 'Nicolas Cage' in x else False)]['genres'].str.split('|'):
    count_genres+=Counter(x)
display(count_genres.most_common())

[('Action', 17),
 ('Thriller', 15),
 ('Drama', 12),
 ('Crime', 10),
 ('Fantasy', 8),
 ('Adventure', 7),
 ('Comedy', 6),
 ('Science Fiction', 4),
 ('Mystery', 3),
 ('Animation', 3),
 ('Family', 3),
 ('History', 2),
 ('War', 1),
 ('Horror', 1),
 ('Romance', 1)]

In [88]:
answer_ls.append(2)

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [39]:
def company_1 (df):
    num = Counter()
    for i in range(len(df)):
        for j in df.iloc[i].production_companies.split('|'):
            num[j] += df.iloc[i].film_n
    return pd.DataFrame.from_dict(num, orient='index', columns = ['Num'])
display(company_1(data).sort_values(by=['Num'], ascending = False))

                                        Num
Universal Pictures                      173
Warner Bros.                            168
Paramount Pictures                      122
Columbia Pictures                       117
Twentieth Century Fox Film Corporation  109
...                                     ...
Ten Thirteen Productions                  1
Outlander Productions                     1
Rocklin / Faust                           1
Cohen/Pearl Productions                   1
Nora Ephron Productions                   1

[1772 rows x 1 columns]

In [89]:
answer_ls.append(1)

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [41]:
display(company_1(data[data['release_year'] == 2015]).sort_values(by=['Num'], ascending = False))

                                        Num
Warner Bros.                             12
Universal Pictures                       10
Twentieth Century Fox Film Corporation    8
Paramount Pictures                        7
Columbia Pictures                         7
...                                     ...
Versus Pictures                           1
DreamWorks Animation                      1
Killer Films                              1
Number 9 Films                            1
Allspark Pictures                         1

[246 rows x 1 columns]

In [90]:
answer_ls.append(4)

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [42]:
def company_2 (df):
    summ = Counter()
    for i in range(len(df)):
        for j in df.iloc[i].production_companies.split('|'):
            summ[j] += df.iloc[i].income      
    return pd.DataFrame.from_dict(summ, orient='index', columns = ['Summ'])
display(company_2(data[data['genres']=='Comedy']).sort_values(by=['Summ'], ascending = False))

                                              Summ
Columbia Pictures                       1140891136
Warner Bros.                            1108301566
Universal Pictures                      1006415624
Twentieth Century Fox Film Corporation   973359761
Green Hat Films                          857726677
...                                            ...
Gracie Films                             -24958633
Ingenious Media                          -33551615
Sunswept Entertainment                   -33551615
Deuce Three Productions                  -33551615
Patalex Productions                      -46604061

[213 rows x 1 columns]

In [91]:
answer_ls.append(3)

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [43]:
display(company_2(data[data['release_year']==2012]).sort_values(by=['Summ'], ascending = False))

                          Summ
Columbia Pictures   2501406608
Universal Pictures  1981011579
Marvel Studios      1299557910
Warner Bros.        1258020056
Relativity Media    1032593938
...                        ...
Onyx Films           -51893525
Jouror Productions   -51893525
Studio 37            -51893525
Transfilm            -51893525
France 2 CinÃ©ma     -82545651

[236 rows x 1 columns]

In [92]:
answer_ls.append(3)

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [93]:
c = Counter()
for i in range(0, len(data)):
    if 'Paramount Pictures' in data['production_companies'].iloc[i]:
        c[data['original_title'].iloc[i]]+=data.iloc[i]['income']
print(c.most_common())

[('Transformers: Dark of the Moon', 928746996), ('Transformers: Revenge of the Fallen', 686297228), ('Indiana Jones and the Kingdom of the Crystal Skull', 601636033), ('Transformers', 559709780), ('Mission: Impossible - Ghost Protocol', 549713380), ('Mission: Impossible - Rogue Nation', 532330139), ('War of the Worlds', 459739379), ('Interstellar', 456752480), ('Mission: Impossible II', 421388105), ('Teenage Mutant Ninja Turtles', 352200000), ('World War Z', 331865000), ('What Women Want', 304111707), ('The Wolf of Wall Street', 292000694), ('Terminator Genisys', 285603537), ('Star Trek Into Darkness', 277365246), ('Mission: Impossible III', 247850012), ('The Adventures of Tintin', 241940071), ('Noah', 237637473), ('The SpongeBob Movie: Sponge Out of Water', 237594032), ('Star Trek', 235680446), ('Shutter Island', 214804195), ('True Grit', 214276927), ('Little Fockers', 210650585), ('Super 8', 210095987), ('Paranormal Activity 3', 200703818), ("Daddy's Home", 190360392), ('The Curious Case of Benjamin Button', 183932083), ('Hansel & Gretel: Witch Hunters', 174803475), ('The Last Airbender', 168502923), ('Lara Croft: Tomb Raider', 159703340), ('Jack Reacher', 158340595), ('Collateral', 152764291), ('Cloverfield', 145764026), ('Hercules', 143400000), ('Up in the Air', 138670000), ('Paranormal Activity 4', 137817992), ('Jackass Presents: Bad Grandpa', 136831537), ('Vanilla Sky', 135388341), ('G.I. Joe: The Rise of Cobra', 127469017), ('How to Lose a Guy in 10 Days', 127371441), ('Beowulf', 125735876), ('Anchorman 2: The Legend Continues', 123649015), ('No Strings Attached', 122780440), ('The Italian Job', 116070171), ('The Dictator', 114379533), ('Mean Girls', 112042871), ('Rango', 110724603), ('The SpongeBob SquarePants Movie', 110161792), ('The Longest Yard', 108320568), ('The Big Short', 105346506), ('World Trade Center', 99945894), ('Disturbia', 97760134), ('The School of Rock', 96282949), ('Dreamgirls', 84937680), ('The Hours', 83846072), ('The Spiderwick Chronicles', 72839667), ("Lemony Snicket's A Series of Unfortunate Events", 69073645), ('Paranormal Activity: The Ghost Dimension', 68099553), ('Stardust', 65560026), ('Jackass Number Two', 61778712), ('Lara Croft Tomb Raider: The Cradle of Life', 61505388), ('Shaft', 61196498), ('Pain & Gain', 61175291), ('Jackass: The Movie', 59282312), ('Watchmen', 55258983), ('Without a Paddle', 50631118), ('Changing Lanes', 49935764), ('Crossroads', 49141030), ('Nacho Libre', 48197993), ('Four Brothers', 47374674), ('Coach Carter', 46669806), ('Along Came a Spider', 45178561), ('We Were Soldiers', 39660784), ('Failure to Launch', 38715192), ('Rat Race', 37498534), ('Paycheck', 36269812), ('Transformers: Age of Extinction', 35500000), ('Shooter', 34696996), ('Zoolander', 32780981), ('Yours, Mine & Ours', 27028752), ('Enemy at the Gates', 26976270), ('Barnyard', 21779000), ('Katy Perry: Part of Me', 20726956), ('Project Almanac', 20248241), ('Zodiac', 19785914), ('Team America: World Police', 18907422), ('Dinner for Schmucks', 17387857), ('The Manchurian Candidate', 16105964), ('Hugo', 15770160), ('Extremely Loud & Incredibly Close', 15247881), ('The Core', 14208267), ('The Gambler', 14171130), ('Clockstoppers', 12793283), ('The Stepford Wives', 12000000), ('Rules of Engagement', 11000000), ('Young Adult', 10939027), ('Hardball', 8222729), ('Star Trek: Nemesis', 7312826), ("Get Rich or Die Tryin'", 6442528), ('Bad News Bears', 4252847), ('The Score', 3069884), ('Fun Size', -2582638), ('Elizabethtown', -4965111), ('The Four Feathers', -5117355), ('Last Holiday', -6600039), ('The Weather Man', -7517225), ('Jack Ryan: Shadow Recruit', -9450893), ('Ã†on Flux', -9695999), ('Sahara', -10730514), ('Sky Captain and the World of Tomorrow', -12041304), ('Serving Sara', -12069815), ('Suspect Zero', -14000000), ('Abandon', -14280643), ('The Fighter', -15809131), ('A Thousand Words', -17955723), ('The Love Guru', -20180936), ('Domestic Disturbance', -20750706), ('Twisted', -24805000), ('Alfie', -46604061), ('Next', -51788987), ('Timeline', -60519261), ('K-19: The Widowmaker', -64831034)]

In [94]:
answer_ls.append(1)

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [44]:
data.groupby(by = ["release_year"])['revenue'].sum()

release_year
2000    10664099805
2001    13017764865
2002    14136361487
2003    14346123312
2004    15663430720
2005    15309425558
2006    14775042320
2007    18162406801
2008    18252781990
2009    20261791024
2010    21082292530
2011    22676791872
2012    23079001687
2013    23213799791
2014    23405862953
2015    25449202382
Name: revenue, dtype: int64

In [51]:
data.groupby([data['release_date'].dt.year]).agg('sum')['income'].sort_values(ascending=False)

release_date
2015    18668572378
2014    16397812953
2012    16077001687
2013    15243179791
2011    14730241341
2009    13423744372
2010    13117292530
2008    11663881990
2007    11565911801
2004     9634180720
2003     9228823312
2002     9002361487
2005     8981925558
2006     8691077320
2001     7950614865
2000     6101399805
Name: income, dtype: int64

In [95]:
answer_ls.append(5)

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [67]:
d = Counter()
for i in range(0, len(data)): 
    if 'Warner Bros. Pictures' in data['production_companies'].iloc[i] or 'Warner Bros.' in data['production_companies'].iloc[i] or 'Warner Bros. Animation' in data['production_companies'].iloc[i] :
           if  data.iloc[i]['income'] > 0:
                d[data['year'].iloc[i]]+=data.iloc[i]['income']
d.most_common(3)

[(2014, 2336068186), (2007, 2284053561), (2008, 2160649265)]

In [96]:
answer_ls.append(1)

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [48]:
data['release_date'] = pd.to_datetime(data['release_date'])
data.groupby(by = [data['release_date'].dt.month])['income'].count()

release_date
1     110
2     135
3     156
4     149
5     140
6     147
7     142
8     161
9     227
10    186
11    146
12    191
Name: income, dtype: int64

In [97]:
answer_ls.append(4)

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [54]:
data['release_month'] = pd.to_datetime(data.release_date).apply(lambda x: x.month)
len(data[data.release_month.isin([6, 7, 8])])

450

In [98]:
answer_ls.append(2)

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [55]:
def director (df):
    director = Counter() 
    for i in range(len(df)):
        for j in df.iloc[i].director.split('|'):
              #if data5['release_month'] = 12:
                director[j] += df.iloc[i].film_n
        
    return pd.DataFrame.from_dict(director, orient='index', columns = ['film_n'])
display(director(data[(data['release_month']== 12)|(data['release_month']== 1) | (data['release_month']== 2)]).sort_values(by=['film_n'], ascending = False))

                   film_n
Peter Jackson           7
Clint Eastwood          6
Steven Soderbergh       6
Martin Scorsese         4
Shawn Levy              4
...                   ...
Iain Softley            1
Anne Fletcher           1
David Frankel           1
Peyton Reed             1
Diane Keaton            1

[359 rows x 1 columns]

In [99]:
answer_ls.append(5)

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [56]:
data['year'] = pd.to_datetime(data.release_date).apply(lambda x: x.year)
test = data.pivot_table(values = 'income', index = 'year', columns = 'release_month', aggfunc = ["sum"], margins = True)
test

                      sum                                                     \
release_month           1           2            3            4            5
year
2000            -26344591   310137593    490709929    124362846   1382722190
2001            127876758   178360689    396218262    659725033    767934975
2002             13657034   557847442    832386092    343737203   1421928692
2003            145423503   422979087    160261385    479653942   2000292657
2004            223449403   727540831    307233119    275005057   2412578839
2005            419099490   506931359    440128754    178673498   1575566228
2006            138996816   317624889    799504296    361121653    985092012
2007             91188025   500661304    714586308    143245753   2042169546
2008            440344541   987454669    251671904    720571689   1744305931
2009            996529660   326413800   1276096794    651749767   1435747314
2010            233051923   671341193   1471122239    841530415   1105092975
2011            591644835   642751509   1443419914   1507477958   1917491757
2012            381045653   573073426   1459834347   1767272417   1140614925
2013            449051535   509981099    970223425   1423545114   1724496337
2014            541637085   736685970   1768873778    795767674   2279978281
2015            630233784   884789565    937945994   2602565518   1103503482
All            5396885454  8854574425  13720216540  12876005537  25039516141

                                                                               \
release_month            6            7           8            9           10
year
2000             517315528    563809888   264018332    175306761    399938512
2001             780612105    873718941   726979609     21874909    146204533
2002             747704475    629306797   579318434    417267245    420527680
2003             406445507   1356384641   444992536    503313816    837090991
2004            1294266591    834850950   332763539    475369751    593314410
2005            1193230558    870215460   266644459    995622427    154493344
2006            2098059770    242337901   429249082    451456811    826087838
2007            2764341802    747619985   881421482    435838557    516228592
2008            1943384763   1791301749   325382603    339476350   1145762453
2009            1520284741   1202339588   803565587    393041320    836577088
2010            2449561498   1567485183   971023396   1091274243   1080204976
2011            1524706926   2331661017   667283164    733166385    968743489
2012            2965481705    940512033   702588445   1308166465   1320250459
2013            2411922008   1192996016   590070005   1165693297   1042812263
2014            1176264662   1611081683  1163610627    596366679   1764509467
2015            3757679861   1552273188   491699146   1775686025    942161764
All            27551262500  18307895020  9640610446  10878921041  12994907859


release_month           11           12           All
year
2000             487934818   1411487999    6101399805
2001            1567240927   1703868124    7950614865
2002            1190606216   1848074177    9002361487
2003             609390731   1862594516    9228823312
2004            1050846495   1106961735    9634180720
2005            1027204825   1354115156    8981925558
2006            1106305898    935240354    8691077320
2007             896805244   1831805203   11565911801
2008             847289768   1126935570   11663881990
2009             558158975   3423239738   13423744372
2010             736020890    899583599   13117292530
2011             859313689   1542580698   14730241341
2012            2412991475   1105170337   16077001687
2013            2047380217   1715008475   15243179791
2014            2043956761   1919080286   16397812953
2015            1212708544   2777325507   18668572378
All            18654155473  26563071474  190478021910

In [100]:
answer_ls.append(3)

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [59]:
data['nlen'] = data.original_title.apply(len)

def counter(movie_bd, x):
    data_plot=movie_bd[x].str.cat(sep='|')
    dat=pd.Series(data_plot.split('|'))
    info=dat.value_counts(ascending=False)
    return info
sum_gen = counter(data,'production_companies')
for gen in sum_gen.index:
    sum_gen[gen] = data['nlen'][data['production_companies'].map(lambda x: True if gen in x else False)].mean()
sum_gen = pd.DataFrame(sum_gen).sort_values(0, ascending=False)
sum_gen

                             0
Four By Two Productions     83
Jim Henson Company, The     59
Dos Corazones               47
Museum Canada Productions   46
Polsky Films                46
...                         ..
Berlanti Productions         3
Everest Entertainment        3
Global Entertainment Group   2
Ixtlan Productions           2
XM2 Productions              2

[1772 rows x 1 columns]

In [101]:
answer_ls.append(5)

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [61]:
data['wlen'] = data.original_title.apply(lambda x: len(x.split()))

def counter(movie_bd, x):
    data_plot=movie_bd[x].str.cat(sep='|')
    dat=pd.Series(data_plot.split('|'))
    info=dat.value_counts(ascending=False)
    return info
sum_gen = counter(data,'production_companies')
for gen in sum_gen.index:
    sum_gen[gen] = data['wlen'][data['production_companies'].map(lambda x: True if gen in x else False)].mean()
sum_gen = pd.DataFrame(sum_gen).sort_values(0, ascending=False)
sum_gen

                            0
Four By Two Productions    12
Jim Henson Company, The    10
Polsky Films                9
The Saul Zaentz Company     9
Dos Corazones               9
...                        ..
ApolloMedia Distribution    1
Film 44                     1
Alpha Core                  1
Fat Free                    1
Sideways Productions Inc.   1

[1772 rows x 1 columns]

In [102]:
answer_ls.append(5)

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [103]:
answer_ls.append(3)

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [62]:
data.sort_values(by='vote_average', ascending=False).head(int(len(data)*0.01)+1)['original_title']

600                                       The Dark Knight
125                                    The Imitation Game
9                                              Inside Out
118                                          Interstellar
34                                                   Room
1082        The Lord of the Rings: The Return of the King
873                                           The Pianist
1801                                              Memento
1192                                     12 Years a Slave
128                                             Gone Girl
138                              The Grand Budapest Hotel
119                               Guardians of the Galaxy
1184                              The Wolf of Wall Street
370                                             Inception
316                                              3 Idiots
1564                Eternal Sunshine of the Spotless Mind
497     The Lord of the Rings: The Fellowship of the Ring
28                                              Spotlight
1214                                   Dallas Buyers Club
Name: original_title, dtype: object

In [104]:
answer_ls.append(1)

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [63]:
import itertools
import collections

_actors=collections.Counter()
for i, d in data.iterrows():
    _a = d.cast.split('|')
    _actors.update([ x for x in itertools.combinations(_a, 2)])
_actors.most_common(5)

[(('Daniel Radcliffe', 'Rupert Grint'), 8),
 (('Daniel Radcliffe', 'Emma Watson'), 8),
 (('Rupert Grint', 'Emma Watson'), 7),
 (('Ben Stiller', 'Owen Wilson'), 6),
 (('Johnny Depp', 'Helena Bonham Carter'), 6)]

In [105]:
answer_ls.append(5)

# 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [ ]:
answer_ls.append(1)

# Submission

In [106]:
len(answer_ls)

35

In [107]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       4
7    8       1
8    9       4
9   10       5
10  11       4
11  12       2
12  13       1
13  14       4
14  15       4
15  16       1
16  17       3
17  18       3
18  19       2
19  20       1
20  21       4
21  22       3
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       5
29  30       3
30  31       5
31  32       5
32  33       3
33  34       1
34  35       5